In [4]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler
from sklearn.cluster import DBSCAN

In [13]:
df= pd.read_excel('D:/Data Science/Assignment/07Clustring/EastWestAirlines.xlsx',sheet_name='data')
df.head()

,ID#,Balance,Qual_miles,cc1_miles,cc2_miles,cc3_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll,Award?
0,1,28143,0,1,1,1,174,1,0,0,7000,0
1,2,19244,0,1,1,1,215,2,0,0,6968,0
2,3,41354,0,1,1,1,4123,4,0,0,7034,0
3,4,14776,0,1,1,1,500,1,0,0,6952,0
4,5,97752,0,4,1,1,43300,26,2077,4,6935,1

In [18]:
def range_x(x):
    return(np.min(x),np.max(x))
for i in range(1,df.shape[1]):
    print(df.columns[i],range_x(df.iloc[:,i]))

Balance (0, 1704838)
Qual_miles (0, 11148)
cc1_miles (1, 5)
cc2_miles (1, 3)
cc3_miles (1, 5)
Bonus_miles (0, 263685)
Bonus_trans (0, 86)
Flight_miles_12mo (0, 30817)
Flight_trans_12 (0, 53)
Days_since_enroll (2, 8296)
Award? (0, 1)

from this data we show the cc1_miles,cc2_miles,cc3_miles are hve very less data, so the provide very less information so we remove them also id is not have any significant value so droped id, and award is categorical data so this is not important so remove award

In [20]:
df.columns

Index(['ID#', 'Balance', 'Qual_miles', 'cc1_miles', 'cc2_miles', 'cc3_miles',
       'Bonus_miles', 'Bonus_trans', 'Flight_miles_12mo', 'Flight_trans_12',
       'Days_since_enroll', 'Award?'],
      dtype='object')

In [26]:
df1=df.drop(columns=['cc1_miles', 'cc2_miles', 'cc3_miles','ID#','Award?'],axis=1)

In [25]:
df1.head()

,Balance,Qual_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll
0,28143,0,174,1,0,0,7000
1,19244,0,215,2,0,0,6968
2,41354,0,4123,4,0,0,7034
3,14776,0,500,1,0,0,6952
4,97752,0,43300,26,2077,4,6935

In [29]:
sc_x = StandardScaler()
x=sc_x.fit_transform(df1.values)
x

array([[-4.51140783e-01, -1.86298687e-01, -7.02786266e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.39545434e+00],
       [-5.39456874e-01, -1.86298687e-01, -7.01088399e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.37995704e+00],
       [-3.20031232e-01, -1.86298687e-01, -5.39252702e-01, ...,
        -3.28603258e-01, -3.62167870e-01,  1.41192021e+00],
       ...,
       [-4.29480975e-05, -1.86298687e-01,  3.43803696e-01, ...,
        -3.28603258e-01, -3.62167870e-01, -1.31560393e+00],
       [-1.85606976e-01, -1.86298687e-01, -6.89286154e-01, ...,
         2.85309024e-02, -9.85033311e-02, -1.31608822e+00],
       [-7.00507951e-01, -1.86298687e-01, -7.09991847e-01, ...,
        -3.28603258e-01, -3.62167870e-01, -1.31754109e+00]])

In [33]:
model=DBSCAN(eps=0.5,min_samples=5)
model.fit(x)
df['cluster']=model.labels_

In [36]:
df.cluster.value_counts()

 0    2927
-1    1058
 3       5
 2       5
 1       4
Name: cluster, dtype: int64

In [38]:
model = DBSCAN(eps=0.6,min_samples=4)
model.fit(x)
df['cluster'] = model.labels_

In [40]:
df.cluster.value_counts()

 0    3181
-1     792
 5       5
 3       5
 4       5
 1       4
 2       4
 6       3
Name: cluster, dtype: int64

In [42]:
df.iloc[:,1:].groupby('cluster').agg('mean')

,Balance,Qual_miles,cc1_miles,cc2_miles,cc3_miles,Bonus_miles,Bonus_trans,Flight_miles_12mo,Flight_trans_12,Days_since_enroll,Award?
cluster,,,,,,,,,,,
-1,159830.291667,712.189394,2.714646,1.016414,1.053030,36542.108586,20.154040,1870.210859,5.424242,4670.296717,0.671717
0,51436.575605,0.000000,1.895316,1.014146,1.002201,12281.092424,9.495442,105.013518,0.348633,3986.695693,0.294247
1,346231.750000,0.000000,4.750000,1.000000,1.000000,56023.750000,14.000000,0.000000,0.000000,6349.750000,0.250000
2,280658.250000,0.000000,5.000000,1.000000,1.000000,63595.750000,16.500000,750.000000,1.750000,5969.750000,1.000000
3,230343.400000,0.000000,1.000000,1.000000,1.000000,5250.000000,3.800000,330.000000,2.600000,3187.000000,0.800000
4,20953.400000,2452.000000,1.000000,1.000000,1.000000,1625.000000,1.200000,0.000000,0.000000,2005.000000,0.200000
5,31515.000000,0.000000,1.000000,1.000000,1.000000,5094.200000,10.200000,2998.200000,8.600000,1760.000000,0.400000
6,68250.666667,0.000000,1.000000,1.000000,1.000000,5470.333333,10.333333,1622.333333,8.333333,1842.333333,0.333333

# Conclusion

As we reduce the eps below .7 number of outliers increases. if we increase eps then number of data points in single cluster increases drastically which will be be about more than 80% of total data points in data set. if we reduce min_samples below 4 number of data points in a single cluster increases and have more than 80% of total data points. if we increases it beyond 5 number of outliers increases drastically and number of data points in a single cluster increases drastically. so we should not apply DBSCAN for this data set we should go for KMEANS or Hierarchical clustering. as DBSCAN best suited for dataset having a lot of outliers and is nonspherical/nonconvex pattern.'